#include <stdio.h>
#include <stdlib.h>

/*Дано натуральное число N. Выведите все его цифры по одной, в обычном порядке (а потом в обратном), разделяя их пробелами или новыми строками. Например: 179 => 1 7 9; 179 => 9 7 1
При решении этой задачи нельзя использовать строки, списки, массивы (ну и циклы, разумеется).
*/

/*int n = 179;
	
	printf("%d\n", n/10); 17
	printf("%d", n%10); 9*/
	
void forw(int n){
	if (n<10){
		printf("%d ", n);
		return;
	}
	forw(n/10);
	printf("%d ", n%10);
}
void backw(int n){
	if (n<10){
		printf("%d ", n);
		return;
	}
	printf("%d ", n%10);
	backw(n/10);
}
int main() {
	printf("Input Num: ");
	int n;
	scanf("%d", &n);
	
	forw(n);
	printf("\n");
	backw(n);

	return 0;
}
